/**
 * 用于存放开发时的假数据
 */
import Vue from 'vue';
import Vuex from 'vuex';

// import {
//   getNotice, getQuestions, getDue, getSubmitted, getHash,
// } from '../api/index';

Vue.use(Vuex);

export default new Vuex.Store({
  state: {
    noticeArray: [
      {
        id: 0,
        title: 'title',
        content: 'content',
        time: 1565247405,
      },
      {
        id: 1,
        title: 'title2',
        content: 'content2',
        time: 1565247405,
      },
      {
        id: 2,
        title: 'title',
        content: 'content',
        time: 1565247405,
      },
      {
        id: 3,
        title: 'title2',
        content: 'content2',
        time: 1565247405,
      },
    ],
    readNoticeArray: [
      {
        id: 1,
        title: 'title2',
        content: 'content2',
        time: 1565247405,
      },
    ],
    questionArray: [
      {
        id: 0,
        title: 'question1',
        content: '1这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: 'true',
        image: [],
        attachment: [],
        options: ['option A', 'option B', 'option C'],
      },
      {
        id: 1,
        title: 'question2',
        content: '2这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '123',
        attachment: [],
        image: ['https://open.saintic.com/api/bingPic/', 'https://open.saintic.com/api/bingPic/'],
        options: [],
      },
      {
        id: 2,
        title: 'question3',
        content: '3这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: 'haha',
        attachment: [
          {
            text: '这是个附件',
            uri: 'https://open.saintic.com/api/bingPic/',
          },
        ],
        image: [],
        options: [],
      },
      {
        id: 3,
        title: 'question4',
        content: '4这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '123123',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 4,
        title: 'question1',
        content: '5这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 5,
        title: 'question2',
        content: '6这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 6,
        title: 'question3',
        content: '7这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 7,
        title: 'question4',
        content: '8这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 8,
        title: 'question1',
        content: '9这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 9,
        title: 'question2',
        content: '10这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 10,
        title: 'question3',
        content: '11这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 11,
        title: 'question4',
        content: '12这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 12,
        title: 'question2',
        content: '10这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 13,
        title: 'question3',
        content: '11这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
      {
        id: 14,
        title: 'question4',
        content: '12这是一道题目的内容，它很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长',
        answer: '',
        image: [],
        attachment: [],
        options: [],
      },
    ],
    due: {
      start: Date.now() - 1200000,
      end: Date.now() + 2400000,
    },
    hash: '5D41402ABC4B2A76B9719D911017C592',
  },
  getters: {
    unreadNoticeCount(state) {
      const { noticeArray, readNoticeArray } = state;
      return noticeArray.length - readNoticeArray.length;
    },
  },
  mutations: {
    handleReadNotice(state) {
      state.readNoticeArray = state.noticeArray;
    },
    handleUpdate(state, newState) {
    },
    handleAnswerChange(state, { value, index }) {
      state.questionArray[index].answer = value;
    },
    injectCommitted(state, newQuestionArray) {
    },
  },
  actions: {
    async update({ commit }, hash) {
    },
    async init({ dispatch, state: { questionArray: tempQuestionArray }, commit }) {
    },
  },
});
